# tap
tap 'koekeishiya/formulae'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# CLI
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# window manager
brew 'yabai'

# hotkey daemon
brew 'skhd'

# shell
brew 'fish'
brew 'starship'

# multiplexer
brew 'tmux'

# editor
brew 'vim'
brew 'neovim'
brew 'editorconfig'

# file browser
brew 'ranger'

# fuzzy finder
brew 'fzf'

# find replacement
brew 'fd'

# ls and tree replacement
brew 'exa'

# better cat
brew 'bat'

# ag
brew 'the_silver_searcher'

# grep replacement
brew 'ripgrep'

# git + hub extension
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'lazygit'

# cloud
brew 'azure-cli'
brew 'awscli'
cask 'aws-vault'

# docker
cask 'docker'
brew 'lazydocker'
brew 'dive'

# postgresql
brew 'postgresql@14'

# redis
brew 'redis'

# ansible
brew 'ansible'

# terraform
brew 'tflint'
brew 'tfsec'

# backup
brew 'restic'

# misc
brew 'openssl'
brew 'howdoi'
brew 'fx'
brew 'jq'
brew 'rclone'
brew 'exiftool'
brew 'imagemagick'
brew 'trash'
brew 'direnv'
brew 'pre-commit'
brew 'reattach-to-user-namespace' # copying in tmux vi-mode. See tmux.conf
brew 'tree'
brew 'grc'
brew 'zoxide'
brew 'gnupg'
brew 'htop'
brew 'ykman'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Fonts
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

cask 'font-jetbrains-mono-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-fontawesome' # spacbar icons

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Applications
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# terminal emulator
cask 'kitty'

# editor
cask 'visual-studio-code'

# bar
brew 'cmacrae/formulae/spacebar'

# utils
cask 'ukelele'

# browsers
cask 'google-chrome'
cask 'firefox-developer-edition'

# comms
cask 'slack'
cask 'discord'
cask 'telegram'

# dev
cask 'insomnia'
cask 'miniconda'
