# tap
tap 'koekeishiya/formulae'
tap 'homebrew/cask-versions'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# CLI
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# window manager
brew 'yabai'

# hotkey daemon
brew 'skhd'

# shell
brew 'fish'
brew 'starship'

# multiplexer
brew 'tmux'

# editor
brew 'vim'
brew 'neovim'
brew 'editorconfig'

# file browser
brew 'ranger'

# fuzzy finder
brew 'fzf'

# find replacement
brew 'fd'

# ls replacement
brew 'lsd'

# better cat
brew 'bat'

# ag
brew 'the_silver_searcher'

# grep replacement
brew 'ripgrep'

# git + hub extension
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'lazygit'

# cloud
brew 'azure-cli'
brew 'awscli'
cask 'aws-vault'

# docker
cask 'docker'
brew 'lazydocker'
brew 'dive'

# postgresql
brew 'postgresql@14'

# redis
brew 'redis'

# terraform
brew 'tflint'
brew 'tfsec'

# backup
brew 'restic'

# rust based cli tools
brew 'dust' # du replacement
brew 'dua-cli'
brew 'dog'
brew 'just'
brew 'procs' # ps replacement

# misc
brew 'ast-grep'
brew 'asciinema'
brew 'openssl'
brew 'howdoi'
brew 'fx'
brew 'jq'
brew 'rclone'
brew 'exiftool'
brew 'imagemagick'
brew 'jless'
brew 'trash'
brew 'direnv'
brew 'pre-commit'
brew 'reattach-to-user-namespace' # copying in tmux vi-mode. See tmux.conf
brew 'tree'
brew 'grc'
brew 'zoxide'
brew 'gnupg'
brew 'htop'
brew 'ykman'
brew' pass'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Applications
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# terminal emulator
cask 'kitty'

# editor
cask 'visual-studio-code'

# bar
brew 'cmacrae/formulae/spacebar'

# utils
cask 'ukelele'

# browsers
cask 'google-chrome'
cask 'firefox-developer-edition'

# comms
cask 'slack'
cask 'discord'
cask 'telegram'

# dev
cask 'insomnia'
cask 'miniconda'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# App Store
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

mas "Bitwarden", id: 1352778147
mas "Tailscale", id: 1475387142
mas "WireGuard", id: 1451685025

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# VSCode extensions
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
vscode "adpyke.vscode-sql-formatter"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "apollographql.vscode-apollo"
vscode "arcanis.vscode-zipfs"
vscode "asvetliakov.vscode-neovim"
vscode "bmalehorn.vscode-fish"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "fabiospampinato.vscode-highlight"
vscode "hashicorp.terraform"
vscode "iciclesoft.workspacesort"
vscode "James-Yu.latex-workshop"
vscode "jpoissonnier.vscode-styled-components"
vscode "matthewpi.caddyfile-support"
vscode "mblode.zotero"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "octref.vetur"
vscode "samuelcolvin.jinjahtml"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "styled-components.vscode-styled-components"
vscode "timonwong.shellcheck"
vscode "trond-snekvik.simple-rst"
vscode "WakaTime.vscode-wakatime"
