# tap
tap 'koekeishiya/formulae'
tap 'FelixKratz/formulae'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# CLI
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# ai
brew 'ollama'
brew 'llama.cpp'

# window manager
brew 'yabai'
brew 'borders' # from FelixKratz/formulae

# hotkey daemon
brew 'skhd'

# shell
brew 'fish'
brew 'starship'
brew 'atuin'

# multiplexer
brew 'tmux'

# editor
brew 'vim'
brew 'neovim'
brew 'editorconfig'

# file browser
brew 'ranger'

# fuzzy finder
brew 'fzf'

# find replacement
brew 'fd'

# ls replacement
brew 'lsd'

# better cat
brew 'bat'

# ag
brew 'the_silver_searcher'

# grep replacement
brew 'ripgrep'

# git + hub extension
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'lazygit'

# cloud
brew 'azure-cli'
brew 'awscli'
cask 'aws-vault'

# docker
cask 'docker'
brew 'lazydocker'
brew 'dive'

# postgresql
brew 'postgresql@14'

# redis
brew 'redis'

# terraform
brew 'tflint'
brew 'tfsec'

# backup
brew 'restic'

# rust based cli tools
brew 'dust' # du replacement
brew 'dua-cli'
brew 'just'
brew 'procs' # ps replacement

# misc
brew 'ast-grep'
brew 'asciinema'
brew 'openssl'
brew 'howdoi'
brew 'jq'
brew 'rclone'
brew 'exiftool'
brew 'imagemagick'
brew 'jless'
brew 'trash' # alias for rm, see system/install.fish
brew 'direnv'
brew 'pre-commit'
brew 'reattach-to-user-namespace' # copying in tmux vi-mode. See tmux.conf
brew 'tree'
brew 'grc'
brew 'zoxide'
brew 'gnupg'
brew 'htop'
brew 'ykman'
brew 'pass'
cask 'macfuse'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Applications
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

# terminal emulator
cask 'kitty'
cask 'ghostty'

# disk space analysis
cask 'czkawka_cli'

# editor
cask 'visual-studio-code'
cask 'zed'

# bar
brew 'sketchybar'

# utils
cask 'ukelele'

# browsers
cask 'google-chrome'
cask 'firefox@developer-edition'

# comms
cask 'slack'
cask 'discord'
cask 'telegram'

# dev
cask 'insomnia'
cask 'miniconda'

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# App Store
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

mas "Bitwarden", id: 1352778147
mas "Tailscale", id: 1475387142
mas "WireGuard", id: 1451685025

# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# VSCode extensions
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
vscode "adpyke.vscode-sql-formatter"
vscode "asvetliakov.vscode-neovim"
vscode "bmalehorn.vscode-fish"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "fabiospampinato.vscode-highlight"
vscode "iciclesoft.workspacesort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "naumovs.color-highlight"
vscode "samuelcolvin.jinjahtml"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "timonwong.shellcheck"
vscode "WakaTime.vscode-wakatime"
